dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC33xED/IfxMcdslight_bf.h
/** \brief Offset for Ifx_MCDSLIGHT_FIFOCTL_Bits.DMC_MODE_P */
#define IFX_MCDSLIGHT_FIFOCTL_DMC_MODE_P_OFF (8u)

/** \brief Length for Ifx_MCDSLIGHT_FIFOCTL_Bits.TRDIS */
#define IFX_MCDSLIGHT_FIFOCTL_TRDIS_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_FIFOCTL_Bits.TRDIS */
#define IFX_MCDSLIGHT_FIFOCTL_TRDIS_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_FIFOCTL_Bits.TRDIS */
#define IFX_MCDSLIGHT_FIFOCTL_TRDIS_OFF (9u)

/** \brief Length for Ifx_MCDSLIGHT_FIFOCTL_Bits.TRON */
#define IFX_MCDSLIGHT_FIFOCTL_TRON_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_FIFOCTL_Bits.TRON */
#define IFX_MCDSLIGHT_FIFOCTL_TRON_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_FIFOCTL_Bits.TRON */
#define IFX_MCDSLIGHT_FIFOCTL_TRON_OFF (10u)

/** \brief Length for Ifx_MCDSLIGHT_FIFOCTL_Bits.TROFF */
#define IFX_MCDSLIGHT_FIFOCTL_TROFF_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_FIFOCTL_Bits.TROFF */
#define IFX_MCDSLIGHT_FIFOCTL_TROFF_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_FIFOCTL_Bits.TROFF */
#define IFX_MCDSLIGHT_FIFOCTL_TROFF_OFF (11u)

/** \brief Length for Ifx_MCDSLIGHT_FIFOCTL_Bits.FLSH */
#define IFX_MCDSLIGHT_FIFOCTL_FLSH_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_FIFOCTL_Bits.FLSH */
#define IFX_MCDSLIGHT_FIFOCTL_FLSH_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_FIFOCTL_Bits.FLSH */
#define IFX_MCDSLIGHT_FIFOCTL_FLSH_OFF (13u)

/** \brief Length for Ifx_MCDSLIGHT_FIFOCTL_Bits.CLR */
#define IFX_MCDSLIGHT_FIFOCTL_CLR_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_FIFOCTL_Bits.CLR */
#define IFX_MCDSLIGHT_FIFOCTL_CLR_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_FIFOCTL_Bits.CLR */
#define IFX_MCDSLIGHT_FIFOCTL_CLR_OFF (14u)

/** \brief Length for Ifx_MCDSLIGHT_FIFOCTL_Bits.SET */
#define IFX_MCDSLIGHT_FIFOCTL_SET_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_FIFOCTL_Bits.SET */
#define IFX_MCDSLIGHT_FIFOCTL_SET_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_FIFOCTL_Bits.SET */
#define IFX_MCDSLIGHT_FIFOCTL_SET_OFF (15u)

/** \brief Length for Ifx_MCDSLIGHT_FIFOCTL_Bits.NTN */
#define IFX_MCDSLIGHT_FIFOCTL_NTN_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_FIFOCTL_Bits.NTN */
#define IFX_MCDSLIGHT_FIFOCTL_NTN_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_FIFOCTL_Bits.NTN */
#define IFX_MCDSLIGHT_FIFOCTL_NTN_OFF (16u)

/** \brief Length for Ifx_MCDSLIGHT_FIFOCTL_Bits.CTTO */
#define IFX_MCDSLIGHT_FIFOCTL_CTTO_LEN (7u)

/** \brief Mask for Ifx_MCDSLIGHT_FIFOCTL_Bits.CTTO */
#define IFX_MCDSLIGHT_FIFOCTL_CTTO_MSK (0x7fu)

/** \brief Offset for Ifx_MCDSLIGHT_FIFOCTL_Bits.CTTO */
#define IFX_MCDSLIGHT_FIFOCTL_CTTO_OFF (24u)

/** \brief Length for Ifx_MCDSLIGHT_FIFOCTL_Bits.CTTO_P */
#define IFX_MCDSLIGHT_FIFOCTL_CTTO_P_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_FIFOCTL_Bits.CTTO_P */
#define IFX_MCDSLIGHT_FIFOCTL_CTTO_P_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_FIFOCTL_Bits.CTTO_P */
#define IFX_MCDSLIGHT_FIFOCTL_CTTO_P_OFF (31u)

/** \brief Length for Ifx_MCDSLIGHT_FIFOWARN_Bits.WARN */
#define IFX_MCDSLIGHT_FIFOWARN_WARN_LEN (16u)

/** \brief Mask for Ifx_MCDSLIGHT_FIFOWARN_Bits.WARN */
#define IFX_MCDSLIGHT_FIFOWARN_WARN_MSK (0xffffu)

/** \brief Offset for Ifx_MCDSLIGHT_FIFOWARN_Bits.WARN */
#define IFX_MCDSLIGHT_FIFOWARN_WARN_OFF (5u)

/** \brief Length for Ifx_MCDSLIGHT_FIFOWARN_Bits.OCDEN */
#define IFX_MCDSLIGHT_FIFOWARN_OCDEN_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_FIFOWARN_Bits.OCDEN */
#define IFX_MCDSLIGHT_FIFOWARN_OCDEN_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_FIFOWARN_Bits.OCDEN */
#define IFX_MCDSLIGHT_FIFOWARN_OCDEN_OFF (30u)

/** \brief Length for Ifx_MCDSLIGHT_FIFOWARN_Bits.EN */
#define IFX_MCDSLIGHT_FIFOWARN_EN_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_FIFOWARN_Bits.EN */
#define IFX_MCDSLIGHT_FIFOWARN_EN_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_FIFOWARN_Bits.EN */
#define IFX_MCDSLIGHT_FIFOWARN_EN_OFF (31u)

/** \brief Length for Ifx_MCDSLIGHT_FIFOOVRCNT_Bits.COUNT */
#define IFX_MCDSLIGHT_FIFOOVRCNT_COUNT_LEN (8u)

/** \brief Mask for Ifx_MCDSLIGHT_FIFOOVRCNT_Bits.COUNT */
#define IFX_MCDSLIGHT_FIFOOVRCNT_COUNT_MSK (0xffu)

/** \brief Offset for Ifx_MCDSLIGHT_FIFOOVRCNT_Bits.COUNT */
#define IFX_MCDSLIGHT_FIFOOVRCNT_COUNT_OFF (0u)

/** \brief Length for Ifx_MCDSLIGHT_FIFOOVRCNT_Bits.CLR */
#define IFX_MCDSLIGHT_FIFOOVRCNT_CLR_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_FIFOOVRCNT_Bits.CLR */
#define IFX_MCDSLIGHT_FIFOOVRCNT_CLR_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_FIFOOVRCNT_Bits.CLR */
#define IFX_MCDSLIGHT_FIFOOVRCNT_CLR_OFF (15u)

/** \brief Length for Ifx_MCDSLIGHT_FIFONTNOW_Bits.NTNOW */
#define IFX_MCDSLIGHT_FIFONTNOW_NTNOW_LEN (16u)

/** \brief Mask for Ifx_MCDSLIGHT_FIFONTNOW_Bits.NTNOW */
#define IFX_MCDSLIGHT_FIFONTNOW_NTNOW_MSK (0xffffu)

/** \brief Offset for Ifx_MCDSLIGHT_FIFONTNOW_Bits.NTNOW */
#define IFX_MCDSLIGHT_FIFONTNOW_NTNOW_OFF (5u)

/** \brief Length for Ifx_MCDSLIGHT_TSUREFCNT_Bits.COUNT */
#define IFX_MCDSLIGHT_TSUREFCNT_COUNT_LEN (32u)

/** \brief Mask for Ifx_MCDSLIGHT_TSUREFCNT_Bits.COUNT */
#define IFX_MCDSLIGHT_TSUREFCNT_COUNT_MSK (0xffffffffu)

/** \brief Offset for Ifx_MCDSLIGHT_TSUREFCNT_Bits.COUNT */
#define IFX_MCDSLIGHT_TSUREFCNT_COUNT_OFF (0u)

/** \brief Length for Ifx_MCDSLIGHT_TSUPRSCL_Bits.RELOAD */
#define IFX_MCDSLIGHT_TSUPRSCL_RELOAD_LEN (32u)

/** \brief Mask for Ifx_MCDSLIGHT_TSUPRSCL_Bits.RELOAD */
#define IFX_MCDSLIGHT_TSUPRSCL_RELOAD_MSK (0xffffffffu)

/** \brief Offset for Ifx_MCDSLIGHT_TSUPRSCL_Bits.RELOAD */
#define IFX_MCDSLIGHT_TSUPRSCL_RELOAD_OFF (0u)

/** \brief Length for Ifx_MCDSLIGHT_TSUEMUCNT_Bits.COUNT */
#define IFX_MCDSLIGHT_TSUEMUCNT_COUNT_LEN (32u)

/** \brief Mask for Ifx_MCDSLIGHT_TSUEMUCNT_Bits.COUNT */
#define IFX_MCDSLIGHT_TSUEMUCNT_COUNT_MSK (0xffffffffu)

/** \brief Offset for Ifx_MCDSLIGHT_TSUEMUCNT_Bits.COUNT */
#define IFX_MCDSLIGHT_TSUEMUCNT_COUNT_OFF (0u)

/** \brief Length for Ifx_MCDSLIGHT_MCXEVT_Bits.EIQ0 */
#define IFX_MCDSLIGHT_MCXEVT_EIQ0_LEN (2u)

/** \brief Mask for Ifx_MCDSLIGHT_MCXEVT_Bits.EIQ0 */
#define IFX_MCDSLIGHT_MCXEVT_EIQ0_MSK (0x3u)

/** \brief Offset for Ifx_MCDSLIGHT_MCXEVT_Bits.EIQ0 */
#define IFX_MCDSLIGHT_MCXEVT_EIQ0_OFF (0u)

