dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC33xED/IfxMcdslight_bf.h
/** \brief Offset for Ifx_MCDSLIGHT_TCYWD_SGN_Bits.RELOAD */
#define IFX_MCDSLIGHT_TCYWD_SGN_RELOAD_OFF (16u)

/** \brief Length for Ifx_MCDSLIGHT_TCYAC_BND_Bits.BOUND */
#define IFX_MCDSLIGHT_TCYAC_BND_BOUND_LEN (14u)

/** \brief Mask for Ifx_MCDSLIGHT_TCYAC_BND_Bits.BOUND */
#define IFX_MCDSLIGHT_TCYAC_BND_BOUND_MSK (0x3fffu)

/** \brief Offset for Ifx_MCDSLIGHT_TCYAC_BND_Bits.BOUND */
#define IFX_MCDSLIGHT_TCYAC_BND_BOUND_OFF (0u)

/** \brief Length for Ifx_MCDSLIGHT_TCYAC_RNG_Bits.RANGE */
#define IFX_MCDSLIGHT_TCYAC_RNG_RANGE_LEN (14u)

/** \brief Mask for Ifx_MCDSLIGHT_TCYAC_RNG_Bits.RANGE */
#define IFX_MCDSLIGHT_TCYAC_RNG_RANGE_MSK (0x3fffu)

/** \brief Offset for Ifx_MCDSLIGHT_TCYAC_RNG_Bits.RANGE */
#define IFX_MCDSLIGHT_TCYAC_RNG_RANGE_OFF (0u)

/** \brief Length for Ifx_MCDSLIGHT_TCYAC_MSK_Bits.SVM */
#define IFX_MCDSLIGHT_TCYAC_MSK_SVM_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_TCYAC_MSK_Bits.SVM */
#define IFX_MCDSLIGHT_TCYAC_MSK_SVM_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_TCYAC_MSK_Bits.SVM */
#define IFX_MCDSLIGHT_TCYAC_MSK_SVM_OFF (0u)

/** \brief Length for Ifx_MCDSLIGHT_TCYAC_MSK_Bits.MASTER */
#define IFX_MCDSLIGHT_TCYAC_MSK_MASTER_LEN (4u)

/** \brief Mask for Ifx_MCDSLIGHT_TCYAC_MSK_Bits.MASTER */
#define IFX_MCDSLIGHT_TCYAC_MSK_MASTER_MSK (0xfu)

/** \brief Offset for Ifx_MCDSLIGHT_TCYAC_MSK_Bits.MASTER */
#define IFX_MCDSLIGHT_TCYAC_MSK_MASTER_OFF (1u)

/** \brief Length for Ifx_MCDSLIGHT_TCYAC_MSK_Bits.SUBCHANNEL */
#define IFX_MCDSLIGHT_TCYAC_MSK_SUBCHANNEL_LEN (7u)

/** \brief Mask for Ifx_MCDSLIGHT_TCYAC_MSK_Bits.SUBCHANNEL */
#define IFX_MCDSLIGHT_TCYAC_MSK_SUBCHANNEL_MSK (0x7fu)

/** \brief Offset for Ifx_MCDSLIGHT_TCYAC_MSK_Bits.SUBCHANNEL */
#define IFX_MCDSLIGHT_TCYAC_MSK_SUBCHANNEL_OFF (5u)

/** \brief Length for Ifx_MCDSLIGHT_TCYAC_MSK_Bits.WR */
#define IFX_MCDSLIGHT_TCYAC_MSK_WR_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_TCYAC_MSK_Bits.WR */
#define IFX_MCDSLIGHT_TCYAC_MSK_WR_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_TCYAC_MSK_Bits.WR */
#define IFX_MCDSLIGHT_TCYAC_MSK_WR_OFF (12u)

/** \brief Length for Ifx_MCDSLIGHT_TCYAC_MSK_Bits.RD */
#define IFX_MCDSLIGHT_TCYAC_MSK_RD_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_TCYAC_MSK_Bits.RD */
#define IFX_MCDSLIGHT_TCYAC_MSK_RD_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_TCYAC_MSK_Bits.RD */
#define IFX_MCDSLIGHT_TCYAC_MSK_RD_OFF (13u)

/** \brief Length for Ifx_MCDSLIGHT_TCYAC_MSK_Bits.MSK */
#define IFX_MCDSLIGHT_TCYAC_MSK_MSK_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_TCYAC_MSK_Bits.MSK */
#define IFX_MCDSLIGHT_TCYAC_MSK_MSK_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_TCYAC_MSK_Bits.MSK */
#define IFX_MCDSLIGHT_TCYAC_MSK_MSK_OFF (14u)

/** \brief Length for Ifx_MCDSLIGHT_TCYDTUFLV_Bits.CURLVL0 */
#define IFX_MCDSLIGHT_TCYDTUFLV_CURLVL0_LEN (4u)

/** \brief Mask for Ifx_MCDSLIGHT_TCYDTUFLV_Bits.CURLVL0 */
#define IFX_MCDSLIGHT_TCYDTUFLV_CURLVL0_MSK (0xfu)

/** \brief Offset for Ifx_MCDSLIGHT_TCYDTUFLV_Bits.CURLVL0 */
#define IFX_MCDSLIGHT_TCYDTUFLV_CURLVL0_OFF (0u)

/** \brief Length for Ifx_MCDSLIGHT_TCYDTUFLV_Bits.MAXLVL0 */
#define IFX_MCDSLIGHT_TCYDTUFLV_MAXLVL0_LEN (4u)

/** \brief Mask for Ifx_MCDSLIGHT_TCYDTUFLV_Bits.MAXLVL0 */
#define IFX_MCDSLIGHT_TCYDTUFLV_MAXLVL0_MSK (0xfu)

/** \brief Offset for Ifx_MCDSLIGHT_TCYDTUFLV_Bits.MAXLVL0 */
#define IFX_MCDSLIGHT_TCYDTUFLV_MAXLVL0_OFF (4u)

/** \brief Length for Ifx_MCDSLIGHT_TCYDTUFLV_Bits.CURLVL1 */
#define IFX_MCDSLIGHT_TCYDTUFLV_CURLVL1_LEN (4u)

/** \brief Mask for Ifx_MCDSLIGHT_TCYDTUFLV_Bits.CURLVL1 */
#define IFX_MCDSLIGHT_TCYDTUFLV_CURLVL1_MSK (0xfu)

/** \brief Offset for Ifx_MCDSLIGHT_TCYDTUFLV_Bits.CURLVL1 */
#define IFX_MCDSLIGHT_TCYDTUFLV_CURLVL1_OFF (8u)

/** \brief Length for Ifx_MCDSLIGHT_TCYDTUFLV_Bits.MAXLVL1 */
#define IFX_MCDSLIGHT_TCYDTUFLV_MAXLVL1_LEN (4u)

/** \brief Mask for Ifx_MCDSLIGHT_TCYDTUFLV_Bits.MAXLVL1 */
#define IFX_MCDSLIGHT_TCYDTUFLV_MAXLVL1_MSK (0xfu)

/** \brief Offset for Ifx_MCDSLIGHT_TCYDTUFLV_Bits.MAXLVL1 */
#define IFX_MCDSLIGHT_TCYDTUFLV_MAXLVL1_OFF (12u)

/** \brief Length for Ifx_MCDSLIGHT_TCYEVT_Bits.EIQ0 */
#define IFX_MCDSLIGHT_TCYEVT_EIQ0_LEN (2u)

/** \brief Mask for Ifx_MCDSLIGHT_TCYEVT_Bits.EIQ0 */
#define IFX_MCDSLIGHT_TCYEVT_EIQ0_MSK (0x3u)

/** \brief Offset for Ifx_MCDSLIGHT_TCYEVT_Bits.EIQ0 */
#define IFX_MCDSLIGHT_TCYEVT_EIQ0_OFF (0u)

/** \brief Length for Ifx_MCDSLIGHT_TCYEVT_Bits.EIQ1 */
#define IFX_MCDSLIGHT_TCYEVT_EIQ1_LEN (2u)

/** \brief Mask for Ifx_MCDSLIGHT_TCYEVT_Bits.EIQ1 */
#define IFX_MCDSLIGHT_TCYEVT_EIQ1_MSK (0x3u)

/** \brief Offset for Ifx_MCDSLIGHT_TCYEVT_Bits.EIQ1 */
#define IFX_MCDSLIGHT_TCYEVT_EIQ1_OFF (2u)

/** \brief Length for Ifx_MCDSLIGHT_TCYEVT_Bits.EIQ2 */
#define IFX_MCDSLIGHT_TCYEVT_EIQ2_LEN (2u)

/** \brief Mask for Ifx_MCDSLIGHT_TCYEVT_Bits.EIQ2 */
#define IFX_MCDSLIGHT_TCYEVT_EIQ2_MSK (0x3u)

/** \brief Offset for Ifx_MCDSLIGHT_TCYEVT_Bits.EIQ2 */
#define IFX_MCDSLIGHT_TCYEVT_EIQ2_OFF (4u)

/** \brief Length for Ifx_MCDSLIGHT_TCYEVT_Bits.EIQ3 */
#define IFX_MCDSLIGHT_TCYEVT_EIQ3_LEN (2u)

/** \brief Mask for Ifx_MCDSLIGHT_TCYEVT_Bits.EIQ3 */
#define IFX_MCDSLIGHT_TCYEVT_EIQ3_MSK (0x3u)

/** \brief Offset for Ifx_MCDSLIGHT_TCYEVT_Bits.EIQ3 */
#define IFX_MCDSLIGHT_TCYEVT_EIQ3_OFF (6u)

/** \brief Length for Ifx_MCDSLIGHT_TCYEVT_Bits.EIQ4 */
#define IFX_MCDSLIGHT_TCYEVT_EIQ4_LEN (2u)

/** \brief Mask for Ifx_MCDSLIGHT_TCYEVT_Bits.EIQ4 */
#define IFX_MCDSLIGHT_TCYEVT_EIQ4_MSK (0x3u)

/** \brief Offset for Ifx_MCDSLIGHT_TCYEVT_Bits.EIQ4 */
#define IFX_MCDSLIGHT_TCYEVT_EIQ4_OFF (8u)

/** \brief Length for Ifx_MCDSLIGHT_TCYEVT_Bits.EIQ5 */
#define IFX_MCDSLIGHT_TCYEVT_EIQ5_LEN (2u)

/** \brief Mask for Ifx_MCDSLIGHT_TCYEVT_Bits.EIQ5 */
#define IFX_MCDSLIGHT_TCYEVT_EIQ5_MSK (0x3u)

/** \brief Offset for Ifx_MCDSLIGHT_TCYEVT_Bits.EIQ5 */
#define IFX_MCDSLIGHT_TCYEVT_EIQ5_OFF (10u)

/** \brief Length for Ifx_MCDSLIGHT_TCYEVT_Bits.EIQ6 */
#define IFX_MCDSLIGHT_TCYEVT_EIQ6_LEN (2u)

/** \brief Mask for Ifx_MCDSLIGHT_TCYEVT_Bits.EIQ6 */
#define IFX_MCDSLIGHT_TCYEVT_EIQ6_MSK (0x3u)

/** \brief Offset for Ifx_MCDSLIGHT_TCYEVT_Bits.EIQ6 */
#define IFX_MCDSLIGHT_TCYEVT_EIQ6_OFF (12u)

