dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC33xED/IfxMcdslight_bf.h
/** \brief Length for Ifx_MCDSLIGHT_TCYEVT_Bits.EIQ7 */
#define IFX_MCDSLIGHT_TCYEVT_EIQ7_LEN (2u)

/** \brief Mask for Ifx_MCDSLIGHT_TCYEVT_Bits.EIQ7 */
#define IFX_MCDSLIGHT_TCYEVT_EIQ7_MSK (0x3u)

/** \brief Offset for Ifx_MCDSLIGHT_TCYEVT_Bits.EIQ7 */
#define IFX_MCDSLIGHT_TCYEVT_EIQ7_OFF (14u)

/** \brief Length for Ifx_MCDSLIGHT_TCYEVT_Bits.EIQ8 */
#define IFX_MCDSLIGHT_TCYEVT_EIQ8_LEN (2u)

/** \brief Mask for Ifx_MCDSLIGHT_TCYEVT_Bits.EIQ8 */
#define IFX_MCDSLIGHT_TCYEVT_EIQ8_MSK (0x3u)

/** \brief Offset for Ifx_MCDSLIGHT_TCYEVT_Bits.EIQ8 */
#define IFX_MCDSLIGHT_TCYEVT_EIQ8_OFF (16u)

/** \brief Length for Ifx_MCDSLIGHT_TCYEVT_Bits.EIQ9 */
#define IFX_MCDSLIGHT_TCYEVT_EIQ9_LEN (2u)

/** \brief Mask for Ifx_MCDSLIGHT_TCYEVT_Bits.EIQ9 */
#define IFX_MCDSLIGHT_TCYEVT_EIQ9_MSK (0x3u)

/** \brief Offset for Ifx_MCDSLIGHT_TCYEVT_Bits.EIQ9 */
#define IFX_MCDSLIGHT_TCYEVT_EIQ9_OFF (18u)

/** \brief Length for Ifx_MCDSLIGHT_TCYEVT_Bits.EIQ10 */
#define IFX_MCDSLIGHT_TCYEVT_EIQ10_LEN (2u)

/** \brief Mask for Ifx_MCDSLIGHT_TCYEVT_Bits.EIQ10 */
#define IFX_MCDSLIGHT_TCYEVT_EIQ10_MSK (0x3u)

/** \brief Offset for Ifx_MCDSLIGHT_TCYEVT_Bits.EIQ10 */
#define IFX_MCDSLIGHT_TCYEVT_EIQ10_OFF (20u)

/** \brief Length for Ifx_MCDSLIGHT_TCYEVT_Bits.EIQ11 */
#define IFX_MCDSLIGHT_TCYEVT_EIQ11_LEN (2u)

/** \brief Mask for Ifx_MCDSLIGHT_TCYEVT_Bits.EIQ11 */
#define IFX_MCDSLIGHT_TCYEVT_EIQ11_MSK (0x3u)

/** \brief Offset for Ifx_MCDSLIGHT_TCYEVT_Bits.EIQ11 */
#define IFX_MCDSLIGHT_TCYEVT_EIQ11_OFF (22u)

/** \brief Length for Ifx_MCDSLIGHT_TCYEVT_Bits.EIQ12 */
#define IFX_MCDSLIGHT_TCYEVT_EIQ12_LEN (2u)

/** \brief Mask for Ifx_MCDSLIGHT_TCYEVT_Bits.EIQ12 */
#define IFX_MCDSLIGHT_TCYEVT_EIQ12_MSK (0x3u)

/** \brief Offset for Ifx_MCDSLIGHT_TCYEVT_Bits.EIQ12 */
#define IFX_MCDSLIGHT_TCYEVT_EIQ12_OFF (24u)

/** \brief Length for Ifx_MCDSLIGHT_TCYEVT_Bits.EIQ13 */
#define IFX_MCDSLIGHT_TCYEVT_EIQ13_LEN (2u)

/** \brief Mask for Ifx_MCDSLIGHT_TCYEVT_Bits.EIQ13 */
#define IFX_MCDSLIGHT_TCYEVT_EIQ13_MSK (0x3u)

/** \brief Offset for Ifx_MCDSLIGHT_TCYEVT_Bits.EIQ13 */
#define IFX_MCDSLIGHT_TCYEVT_EIQ13_OFF (26u)

/** \brief Length for Ifx_MCDSLIGHT_TCYEVT_Bits.EIQ14 */
#define IFX_MCDSLIGHT_TCYEVT_EIQ14_LEN (2u)

/** \brief Mask for Ifx_MCDSLIGHT_TCYEVT_Bits.EIQ14 */
#define IFX_MCDSLIGHT_TCYEVT_EIQ14_MSK (0x3u)

/** \brief Offset for Ifx_MCDSLIGHT_TCYEVT_Bits.EIQ14 */
#define IFX_MCDSLIGHT_TCYEVT_EIQ14_OFF (28u)

/** \brief Length for Ifx_MCDSLIGHT_TCYEVT_Bits.EIQ15 */
#define IFX_MCDSLIGHT_TCYEVT_EIQ15_LEN (2u)

/** \brief Mask for Ifx_MCDSLIGHT_TCYEVT_Bits.EIQ15 */
#define IFX_MCDSLIGHT_TCYEVT_EIQ15_MSK (0x3u)

/** \brief Offset for Ifx_MCDSLIGHT_TCYEVT_Bits.EIQ15 */
#define IFX_MCDSLIGHT_TCYEVT_EIQ15_OFF (30u)

/** \brief Length for Ifx_MCDSLIGHT_TCYACT_Bits.AIS0 */
#define IFX_MCDSLIGHT_TCYACT_AIS0_LEN (5u)

/** \brief Mask for Ifx_MCDSLIGHT_TCYACT_Bits.AIS0 */
#define IFX_MCDSLIGHT_TCYACT_AIS0_MSK (0x1fu)

/** \brief Offset for Ifx_MCDSLIGHT_TCYACT_Bits.AIS0 */
#define IFX_MCDSLIGHT_TCYACT_AIS0_OFF (0u)

/** \brief Length for Ifx_MCDSLIGHT_TCYACT_Bits.AIQ0 */
#define IFX_MCDSLIGHT_TCYACT_AIQ0_LEN (2u)

/** \brief Mask for Ifx_MCDSLIGHT_TCYACT_Bits.AIQ0 */
#define IFX_MCDSLIGHT_TCYACT_AIQ0_MSK (0x3u)

/** \brief Offset for Ifx_MCDSLIGHT_TCYACT_Bits.AIQ0 */
#define IFX_MCDSLIGHT_TCYACT_AIQ0_OFF (5u)

/** \brief Length for Ifx_MCDSLIGHT_TCYACT_Bits.LV0 */
#define IFX_MCDSLIGHT_TCYACT_LV0_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_TCYACT_Bits.LV0 */
#define IFX_MCDSLIGHT_TCYACT_LV0_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_TCYACT_Bits.LV0 */
#define IFX_MCDSLIGHT_TCYACT_LV0_OFF (7u)

/** \brief Length for Ifx_MCDSLIGHT_TCYACT_Bits.AIS1 */
#define IFX_MCDSLIGHT_TCYACT_AIS1_LEN (5u)

/** \brief Mask for Ifx_MCDSLIGHT_TCYACT_Bits.AIS1 */
#define IFX_MCDSLIGHT_TCYACT_AIS1_MSK (0x1fu)

/** \brief Offset for Ifx_MCDSLIGHT_TCYACT_Bits.AIS1 */
#define IFX_MCDSLIGHT_TCYACT_AIS1_OFF (8u)

/** \brief Length for Ifx_MCDSLIGHT_TCYACT_Bits.AIQ1 */
#define IFX_MCDSLIGHT_TCYACT_AIQ1_LEN (2u)

/** \brief Mask for Ifx_MCDSLIGHT_TCYACT_Bits.AIQ1 */
#define IFX_MCDSLIGHT_TCYACT_AIQ1_MSK (0x3u)

/** \brief Offset for Ifx_MCDSLIGHT_TCYACT_Bits.AIQ1 */
#define IFX_MCDSLIGHT_TCYACT_AIQ1_OFF (13u)

/** \brief Length for Ifx_MCDSLIGHT_TCYACT_Bits.LV1 */
#define IFX_MCDSLIGHT_TCYACT_LV1_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_TCYACT_Bits.LV1 */
#define IFX_MCDSLIGHT_TCYACT_LV1_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_TCYACT_Bits.LV1 */
#define IFX_MCDSLIGHT_TCYACT_LV1_OFF (15u)

/** \brief Length for Ifx_MCDSLIGHT_TCYACT_Bits.AIS2 */
#define IFX_MCDSLIGHT_TCYACT_AIS2_LEN (5u)

/** \brief Mask for Ifx_MCDSLIGHT_TCYACT_Bits.AIS2 */
#define IFX_MCDSLIGHT_TCYACT_AIS2_MSK (0x1fu)

/** \brief Offset for Ifx_MCDSLIGHT_TCYACT_Bits.AIS2 */
#define IFX_MCDSLIGHT_TCYACT_AIS2_OFF (16u)

/** \brief Length for Ifx_MCDSLIGHT_TCYACT_Bits.AIQ2 */
#define IFX_MCDSLIGHT_TCYACT_AIQ2_LEN (2u)

/** \brief Mask for Ifx_MCDSLIGHT_TCYACT_Bits.AIQ2 */
#define IFX_MCDSLIGHT_TCYACT_AIQ2_MSK (0x3u)

/** \brief Offset for Ifx_MCDSLIGHT_TCYACT_Bits.AIQ2 */
#define IFX_MCDSLIGHT_TCYACT_AIQ2_OFF (21u)

/** \brief Length for Ifx_MCDSLIGHT_TCYACT_Bits.LV2 */
#define IFX_MCDSLIGHT_TCYACT_LV2_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_TCYACT_Bits.LV2 */
#define IFX_MCDSLIGHT_TCYACT_LV2_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_TCYACT_Bits.LV2 */
#define IFX_MCDSLIGHT_TCYACT_LV2_OFF (23u)

/** \brief Length for Ifx_MCDSLIGHT_TCYACT_Bits.AIS3 */
#define IFX_MCDSLIGHT_TCYACT_AIS3_LEN (5u)

/** \brief Mask for Ifx_MCDSLIGHT_TCYACT_Bits.AIS3 */
#define IFX_MCDSLIGHT_TCYACT_AIS3_MSK (0x1fu)

/** \brief Offset for Ifx_MCDSLIGHT_TCYACT_Bits.AIS3 */
#define IFX_MCDSLIGHT_TCYACT_AIS3_OFF (24u)

/** \brief Length for Ifx_MCDSLIGHT_TCYACT_Bits.AIQ3 */
#define IFX_MCDSLIGHT_TCYACT_AIQ3_LEN (2u)

/** \brief Mask for Ifx_MCDSLIGHT_TCYACT_Bits.AIQ3 */
#define IFX_MCDSLIGHT_TCYACT_AIQ3_MSK (0x3u)

/** \brief Offset for Ifx_MCDSLIGHT_TCYACT_Bits.AIQ3 */
#define IFX_MCDSLIGHT_TCYACT_AIQ3_OFF (29u)

/** \brief Length for Ifx_MCDSLIGHT_TCYACT_Bits.LV3 */
#define IFX_MCDSLIGHT_TCYACT_LV3_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_TCYACT_Bits.LV3 */
#define IFX_MCDSLIGHT_TCYACT_LV3_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_TCYACT_Bits.LV3 */
#define IFX_MCDSLIGHT_TCYACT_LV3_OFF (31u)

/** \brief Length for Ifx_MCDSLIGHT_TCYIP_BND_Bits.BOUND */
#define IFX_MCDSLIGHT_TCYIP_BND_BOUND_LEN (31u)

/** \brief Mask for Ifx_MCDSLIGHT_TCYIP_BND_Bits.BOUND */
#define IFX_MCDSLIGHT_TCYIP_BND_BOUND_MSK (0x7fffffffu)

/** \brief Offset for Ifx_MCDSLIGHT_TCYIP_BND_Bits.BOUND */
#define IFX_MCDSLIGHT_TCYIP_BND_BOUND_OFF (1u)

/** \brief Length for Ifx_MCDSLIGHT_TCYIP_RNG_Bits.RANGE */
#define IFX_MCDSLIGHT_TCYIP_RNG_RANGE_LEN (31u)

/** \brief Mask for Ifx_MCDSLIGHT_TCYIP_RNG_Bits.RANGE */
#define IFX_MCDSLIGHT_TCYIP_RNG_RANGE_MSK (0x7fffffffu)

/** \brief Offset for Ifx_MCDSLIGHT_TCYIP_RNG_Bits.RANGE */
#define IFX_MCDSLIGHT_TCYIP_RNG_RANGE_OFF (1u)

/** \}  */

/******************************************************************************/

/******************************************************************************/

#endif /* IFXMCDSLIGHT_BF_H */
